stxent/halm/include/halm/platform/lpc/lpc43xx/ethernet_defs.h
/*
 * halm/platform/lpc/ethernet_defs.h
 * Copyright (C) 2021 xent
 * Project is distributed under the terms of the MIT License
 */

#ifndef HALM_PLATFORM_LPC_LPC43XX_ETHERNET_DEFS_H_
#define HALM_PLATFORM_LPC_LPC43XX_ETHERNET_DEFS_H_
/*----------------------------------------------------------------------------*/
#include <xcore/bits.h>
#include <stdint.h>
/*------------------MAC Configuration register--------------------------------*/
/* Receiver Enable */
#define MAC_CONFIG_RE                   BIT(2)
/* Transmitter Enable */
#define MAC_CONFIG_TE                   BIT(3)
/* Deferral Check */
#define MAC_CONFIG_DF                   BIT(4)

/* Back-Off Limit */
#define MAC_CONFIG_BL(value)            BIT_FIELD((value), 5)
#define MAC_CONFIG_BL_MASK              BIT_FIELD(MASK(2), 5)
#define MAC_CONFIG_BL_VALUE(reg) \
    FIELD_VALUE((reg), MAC_CONFIG_BL_MASK, 5)

/* Automatic Pad/CRC Stripping */
#define MAC_CONFIG_ACS                  BIT(7)
/* Link Up/Down */
#define MAC_CONFIG_LINK                 BIT(8)
/* Disable Retry */
#define MAC_CONFIG_DR                   BIT(9)
/* Full-duplex mode */
#define MAC_CONFIG_DM                   BIT(11)
/* Loopback mode */
#define MAC_CONFIG_LM                   BIT(12)
/* Disable receive own */
#define MAC_CONFIG_DO                   BIT(13)
/* Speed: 0 for 10 Mbps, 1 for 100 Mbps */
#define MAC_CONFIG_FES                  BIT(14)
/* Port Select */
#define MAC_CONFIG_PS                   BIT(15)
/* Disable carrier sense during transmission */
#define MAC_CONFIG_DCRS                 BIT(16)

/* Inter-frame gap */
#define MAC_CONFIG_IFG(value)           BIT_FIELD((value), 17)
#define MAC_CONFIG_IFG_MASK             BIT_FIELD(MASK(3), 17)
#define MAC_CONFIG_IFG_VALUE(reg) \
    FIELD_VALUE((reg), MAC_CONFIG_IFG_MASK, 17)

/* Jumbo Frame Enable */
#define MAC_CONFIG_JE                   BIT(20)
/* Jabber Disable */
#define MAC_CONFIG_JD                   BIT(22)
/* Watchdog Disable */
#define MAC_CONFIG_WD                   BIT(23)
/*------------------MAC Frame Filter register---------------------------------*/
enum
{
  PCF_FILTER_ALL        = 0x00,
  PCF_FILTER_PAUSE      = 0x01,
  PCF_FILTER_NONE       = 0x02,
  PCF_FILTER_BY_ADDRESS = 0x03
};

/* Promiscuous Mode */
#define MAC_FILTER_PR                   BIT(0)
/* Hash Unicast */
#define MAC_FILTER_HUC                  BIT(1)
/* Hash Multicast */
#define MAC_FILTER_HMC                  BIT(2)
/* DA Inverse Filtering */
#define MAC_FILTER_DAIF                 BIT(3)
/* Pass All Multicast */
#define MAC_FILTER_PM                   BIT(4)
/* Disable Broadcast Frames */
#define MAC_FILTER_DBF                  BIT(5)

/* Pass Control Frames */
#define MAC_FILTER_PCF(value)           BIT_FIELD((value), 6)
#define MAC_FILTER_PCF_MASK             BIT_FIELD(MASK(2), 6)
#define MAC_FILTER_PCF_VALUE(reg) \
    FIELD_VALUE((reg), MAC_FILTER_PCF_MASK, 6)

/* Hash or perfect filter */
#define MAC_FILTER_HPF                  BIT(10)
/* Receive All */
#define MAC_FILTER_RA                   BIT(31)
/*------------------MAC MII Address register----------------------------------*/
enum
{
  CR_CLOCK_DIV_42   = 0x00,
  CR_CLOCK_DIV_62   = 0x01,
  CR_CLOCK_DIV_16   = 0x02,
  CR_CLOCK_DIV_26   = 0x03,
  CR_CLOCK_DIV_102  = 0x04,
  CR_CLOCK_DIV_124  = 0x05
};

/* MII busy */
#define MAC_MII_ADDR_GB                 BIT(0)
/* MII write */
#define MAC_MII_ADDR_W                  BIT(1)

/* CSR clock range */
#define MAC_MII_ADDR_CR(value)          BIT_FIELD((value), 2)
#define MAC_MII_ADDR_CR_MASK            BIT_FIELD(MASK(4), 2)
#define MAC_MII_ADDR_CR_VALUE(reg) \
    FIELD_VALUE((reg), MAC_MII_ADDR_CR_MASK, 2)

/* MII register */
#define MAC_MII_ADDR_GR(value)          BIT_FIELD((value), 6)
#define MAC_MII_ADDR_GR_MASK            BIT_FIELD(MASK(5), 6)
#define MAC_MII_ADDR_GR_VALUE(reg) \
    FIELD_VALUE((reg), MAC_MII_ADDR_GR_MASK, 6)

/* Physical layer address */
#define MAC_MII_ADDR_PA(value)          BIT_FIELD((value), 11)
#define MAC_MII_ADDR_PA_MASK            BIT_FIELD(MASK(5), 11)
#define MAC_MII_ADDR_PA_VALUE(reg) \
    FIELD_VALUE((reg), MAC_MII_ADDR_PA_MASK, 11)
/*------------------MAC Flow Control register---------------------------------*/
/* Flow Control Busy/Backpressure Activate */
#define MAC_FLOW_CTRL_FCB               BIT(0)
/* Transmit Flow Control Enable */
#define MAC_FLOW_CTRL_TFE               BIT(1)
/* Receive Flow Control Enable */
#define MAC_FLOW_CTRL_RFE               BIT(2)
/* Unicast Pause Frame Detect */
#define MAC_FLOW_CTRL_UP                BIT(3)

/* Pause Low Threshold */
#define MAC_FLOW_CTRL_PLT(value)        BIT_FIELD((value), 4)
#define MAC_FLOW_CTRL_PLT_MASK          BIT_FIELD(MASK(2), 4)
#define MAC_FLOW_CTRL_PLT_VALUE(reg) \
    FIELD_VALUE((reg), MAC_FLOW_CTRL_PLT_MASK, 4)

/* Disable Zero-Quanta Pause */
#define MAC_FLOW_CTRL_DZPQ              BIT(7)

/* Physical layer address */
#define MAC_FLOW_CTRL_PT(value)         BIT_FIELD((value), 16)
#define MAC_FLOW_CTRL_PT_MASK           BIT_FIELD(MASK(16), 16)
#define MAC_FLOW_CTRL_PT_VALUE(reg) \
    FIELD_VALUE((reg), MAC_FLOW_CTRL_PT_MASK, 16)
/*------------------MAC VLAN Tag register-------------------------------------*/
/* VLAN Tag Identifier for Receive Frames */
#define MAC_VLAN_TAG_VL(value)          BIT_FIELD((value), 0)
#define MAC_VLAN_TAG_VL_MASK            BIT_FIELD(MASK(16), 0)
#define MAC_VLAN_TAG_VL_VALUE(reg) \
    FIELD_VALUE((reg), MAC_VLAN_TAG_VL_MASK, 0)

/* Enable 12-bit VLAN Tag Comparison */
#define MAC_VLAN_TAG_ETV                BIT(16)
/*------------------MAC Debug register----------------------------------------*/
/* MAC MII receive protocol engine is active */
#define MAC_DEBUG_RXIDLESTAT            BIT(0)

/* State of the small FIFO Read and Write controllers */
#define MAC_DEBUG_FIFOSTAT0(value)      BIT_FIELD((value), 1)
#define MAC_DEBUG_FIFOSTAT0_MASK        BIT_FIELD(MASK(2), 1)
#define MAC_DEBUG_FIFOSTAT0_VALUE(reg) \
    FIELD_VALUE((reg), MAC_DEBUG_FIFOSTAT0_MASK, 1)

/* RxFIFO Write Controller is active */
#define MAC_DEBUG_RXFIFOSTAT1           BIT(4)

