stxent/halm/include/halm/platform/lpc/lpc43xx/ethernet_defs.h
/* State of the RxFIFO Read controller */
#define MAC_DEBUG_RXFIFOSTAT(value)     BIT_FIELD((value), 5)
#define MAC_DEBUG_RXFIFOSTAT_MASK       BIT_FIELD(MASK(2), 5)
#define MAC_DEBUG_RXFIFOSTAT_VALUE(reg) \
    FIELD_VALUE((reg), MAC_DEBUG_RXFIFOSTAT_MASK, 5)

/* Status of the RxFIFO fill-level */
#define MAC_DEBUG_RXFIFOLVL(value)      BIT_FIELD((value), 8)
#define MAC_DEBUG_RXFIFOLVL_MASK        BIT_FIELD(MASK(2), 8)
#define MAC_DEBUG_RXFIFOLVL_VALUE(reg) \
    FIELD_VALUE((reg), MAC_DEBUG_RXFIFOLVL_MASK, 8)

/* MAC MII transmit protocol engine is active */
#define MAC_DEBUG_TXIDLESTAT            BIT(16)

/* State of the MAC Transmit Frame controller */
#define MAC_DEBUG_TXSTAT(value)         BIT_FIELD((value), 17)
#define MAC_DEBUG_TXSTAT_MASK           BIT_FIELD(MASK(2), 17)
#define MAC_DEBUG_TXSTAT_VALUE(reg) \
    FIELD_VALUE((reg), MAC_DEBUG_TXSTAT_MASK, 17)

/* MAC transmitter is in PAUSE condition */
#define MAC_DEBUG_PAUSE                 BIT(19)

/* State of the TxFIFO Read controller */
#define MAC_DEBUG_TXFIFOSTAT(value)     BIT_FIELD((value), 20)
#define MAC_DEBUG_TXFIFOSTAT_MASK       BIT_FIELD(MASK(2), 20)
#define MAC_DEBUG_TXFIFOSTAT_VALUE(reg) \
    FIELD_VALUE((reg), MAC_DEBUG_TXFIFOSTAT_MASK, 20)

/* TxFIFO Write Controller is active */
#define MAC_DEBUG_TXFIFOSTAT1           BIT(22)
/* TxFIFO is not empty */
#define MAC_DEBUG_TXFIFOLVL             BIT(24)
/* TxFIFO is full */
#define MAC_DEBUG_TXFIFOFULL            BIT(25)
/*------------------MAC PMT Control and Status register-----------------------*/
/* Power-down */
#define MAC_PMT_CTRL_STAT_PD            BIT(0)
/* Magic packet enable */
#define MAC_PMT_CTRL_STAT_MPE           BIT(1)
/* Wake-up frame enable */
#define MAC_PMT_CTRL_STAT_WFE           BIT(2)
/* Magic packet received */
#define MAC_PMT_CTRL_STAT_MPR           BIT(5)
/* Wake-up frame received */
#define MAC_PMT_CTRL_STAT_WFR           BIT(6)
/* Global Unicast */
#define MAC_PMT_CTRL_STAT_GU            BIT(9)
/* Wake-up frame filter register pointer reset */
#define MAC_PMT_CTRL_STAT_WFFRPR        BIT(31)
/*------------------MAC Interrupt Status register-----------------------------*/
/* PMT Interrupt Status */
#define MAC_INTR_PMT                    BIT(3)
/* Timestamp Interrupt Status */
#define MAC_INTR_TS                     BIT(9)
/*------------------MAC Interrupt Mask register-------------------------------*/
/* PMT Interrupt Mask */
#define MAC_INTR_MASK_PMTIM             BIT(3)
/* Timestamp Interrupt Mask */
#define MAC_INTR_MASK_TSIM              BIT(9)
/*------------------MAC Address 0 High register-------------------------------*/
#define MAC_ADDR0_HIGH_ADDRESS(value)   BIT_FIELD((value)), 0)
#define MAC_ADDR0_HIGH_ADDRESS_MASK     BIT_FIELD(MASK(16), 0)
#define MAC_ADDR0_HIGH_ADDRESS_VALUE(reg) \
    FIELD_VALUE((reg), MAC_ADDR0_HIGH_ADDRESS_MASK, 0)

#define MAC_ADDR0_HIGH_MO               BIT(31)
/*------------------Time Stamp Control register-------------------------------*/
/* Time stamp Enable */
#define MAC_TIMESTP_CTRL_TSENA          BIT(0)
/* Time stamp Fine or Coarse Update */
#define MAC_TIMESTP_CTRL_TSCFUPDT       BIT(1)
/* Time stamp Initialize */
#define MAC_TIMESTP_CTRL_TSINIT         BIT(2)
/* Time stamp Update */
#define MAC_TIMESTP_CTRL_TSUPDT         BIT(3)
/* Time stamp Interrupt Trigger Enable */
#define MAC_TIMESTP_CTRL_TSTRIG         BIT(4)
/* Addend Reg Update */
#define MAC_TIMESTP_CTRL_TSADDREG       BIT(5)
/* Enable Time stamp for all frames */
#define MAC_TIMESTP_CTRL_TSENALL        BIT(8)
/* Time stamp digital or binary rollover control */
#define MAC_TIMESTP_CTRL_TSCTRLSSR      BIT(9)
/* Enable PTP packet snooping for version 2 format */
#define MAC_TIMESTP_CTRL_TSVER2ENA      BIT(10)
/* Enable Time stamp snapshot for PTP over Ethernet frames */
#define MAC_TIMESTP_CTRL_TSIPENA        BIT(11)
/* Enable Time stamp snapshot for IPv6 frames */
#define MAC_TIMESTP_CTRL_TSIPV6ENA      BIT(12)
/* Enable Time stamp snapshot for IPv4 frames */
#define MAC_TIMESTP_CTRL_TSIPV4ENA      BIT(13)
/* Enable Time stamp snapshot for Event Messages */
#define MAC_TIMESTP_CTRL_TSEVNTENA      BIT(14)
/* Enable snapshot for messages relevant to master */
#define MAC_TIMESTP_CTRL_TSMSTRENA      BIT(15)

/* Select the type of clock node */
#define MAC_TIMESTP_CTRL_TSCLKTYPE(value) \
    BIT_FIELD((value), 16)
#define MAC_TIMESTP_CTRL_TSCLKTYPE_MASK \
    BIT_FIELD(MASK(2), 16)
#define MAC_TIMESTP_CTRL_TSCLKTYPE_VALUE(reg) \
    FIELD_VALUE((reg), MAC_TIMESTP_CTRL_TSCLKTYPE_MASK, 16)

/* Enable MAC address for PTP frame filtering */
#define MAC_TIMESTP_CTRL_TSENMACADDR    BIT(18)
/*------------------System time Nanoseconds register--------------------------*/
/* Time stamp sub seconds */
#define NANOSECONDS_TSSS(value)         BIT_FIELD((value), 0)
#define NANOSECONDS_TSSS_MASK           BIT_FIELD(MASK(31), 0)
#define NANOSECONDS_TSSS_VALUE(reg) \
    FIELD_VALUE((reg), NANOSECONDS_TSSS_MASK, 0)

/* Positive or negative time */
#define NANOSECONDS_PSNT                BIT(31)
/*------------------System time Nanoseconds Update register-------------------*/
/* Time stamp sub seconds */
#define NANOSECONDSUPDATE_TSSS(value) \
    BIT_FIELD((value), 0)
#define NANOSECONDSUPDATE_TSSS_MASK \
    BIT_FIELD(MASK(31), 0)
#define NANOSECONDSUPDATE_TSSS_VALUE(reg) \
    FIELD_VALUE((reg), NANOSECONDSUPDATE_TSSS_MASK, 0)

/* Add or subtract time */
#define NANOSECONDSUPDATE_ADDSUB        BIT(31)
/*------------------Time stamp Status register--------------------------------*/
/* Time stamp seconds overflow */
#define TIMESTAMPSTAT_TSSOVF            BIT(0)
/* Time stamp target reached */
#define TIMESTAMPSTAT_TSTARGT           BIT(1)
/*------------------DMA Bus Mode register-------------------------------------*/
/* Software reset */
#define DMA_BUS_MODE_SWR                BIT(0)
/* DMA arbitration scheme */
#define DMA_BUS_MODE_DA                 BIT(1)

/* Descriptor skip length */
#define DMA_BUS_MODE_DSL(value)         BIT_FIELD((value), 2)
#define DMA_BUS_MODE_DSL_MASK           BIT_FIELD(MASK(5), 2)
#define DMA_BUS_MODE_DSL_VALUE(reg) \
    FIELD_VALUE((reg), DMA_BUS_MODE_DSL_MASK, 2)

