stxent/halm/include/halm/platform/lpc/lpc43xx/ethernet_defs.h
/* Alternate descriptor size */
#define DMA_BUS_MODE_ATDS               BIT(7)

/* Programmable burst length */
#define DMA_BUS_MODE_PBL(value)         BIT_FIELD((value), 8)
#define DMA_BUS_MODE_PBL_MASK           BIT_FIELD(MASK(6), 8)
#define DMA_BUS_MODE_PBL_VALUE(reg) \
    FIELD_VALUE((reg), DMA_BUS_MODE_PBL_MASK, 8)

/* Rx-to-Tx priority ratio */
#define DMA_BUS_MODE_PR(value)          BIT_FIELD((value), 14)
#define DMA_BUS_MODE_PR_MASK            BIT_FIELD(MASK(2), 14)
#define DMA_BUS_MODE_PR_VALUE(reg) \
    FIELD_VALUE((reg), DMA_BUS_MODE_PR_MASK, 14)

/* Fixed burst */
#define DMA_BUS_MODE_FB                 BIT(16)

/* RxDMA PBL */
#define DMA_BUS_MODE_RPBL(value)        BIT_FIELD((value), 17)
#define DMA_BUS_MODE_RPBL_MASK          BIT_FIELD(MASK(6), 17)
#define DMA_BUS_MODE_RPBL_VALUE(reg) \
    FIELD_VALUE((reg), DMA_BUS_MODE_RPBL_MASK, 17)

/* Use separate PBL */
#define DMA_BUS_MODE_USP                BIT(23)
/* 8 x PBL mode */
#define DMA_BUS_MODE_PBL8X              BIT(24)
/* Address-aligned beats */
#define DMA_BUS_MODE_AAL                BIT(25)
/* Mixed burst */
#define DMA_BUS_MODE_MB                 BIT(26)
/* Transmit DMA has higher priority than the Receive DMA */
#define DMA_BUS_MODE_TXPR               BIT(27)
/*------------------DMA Status register---------------------------------------*/
enum
{
  RS_STOPPED              = 0x00,
  RS_FETCHING_DESCRIPTOR  = 0x01,
  RS_WAITING_FOR_PACKET   = 0x03,
  RS_SUSPENDED            = 0x04,
  RS_CLOSING_DESCRIPTOR   = 0x05,
  RS_TIME_STAMP           = 0x06,
  RS_WRITIN_TO_MEMORY     = 0x07
};

enum
{
  TS_STOPPED              = 0x00,
  TS_FETCHING_DESCRIPTOR  = 0x01,
  TS_WAITING_FOR_STATUS   = 0x02,
  TS_READING_FROM_MEMORY  = 0x03,
  TS_TIME_STAMP           = 0x04,
  TS_SUSPENDED            = 0x06,
  TS_CLOSING_DESCRIPTOR   = 0x07
};

/* Transmit interrupt */
#define DMA_STAT_TI                     BIT(0)
/* Transmit process stopped */
#define DMA_STAT_TPS                    BIT(1)
/* Transmit buffer unavailable */
#define DMA_STAT_TU                     BIT(2)
/* Transmit jabber timeout */
#define DMA_STAT_TJT                    BIT(3)
/* Receive overflow */
#define DMA_STAT_OVF                    BIT(4)
/* Transmit underflow */
#define DMA_STAT_UNF                    BIT(5)
/* Receive interrupt */
#define DMA_STAT_RI                     BIT(6)
/* Receive buffer unavailable */
#define DMA_STAT_RU                     BIT(7)
/* Receive process stopped */
#define DMA_STAT_RPS                    BIT(8)
/* Receive watchdog timeout */
#define DMA_STAT_RWT                    BIT(9)
/* Early transmit interrupt */
#define DMA_STAT_ETI                    BIT(10)
/* Fatal bus error interrupt */
#define DMA_STAT_FBI                    BIT(13)
/* Early receive interrupt */
#define DMA_STAT_ERI                    BIT(14)
/* Abnormal interrupt summary */
#define DMA_STAT_AIE                    BIT(15)
/* Normal interrupt summary */
#define DMA_STAT_NIS                    BIT(16)

/* Receive process state */
#define DMA_STAT_RS(value)              BIT_FIELD((value), 17)
#define DMA_STAT_RS_MASK                BIT_FIELD(MASK(3), 17)
#define DMA_STAT_RS_VALUE(reg)          FIELD_VALUE((reg), DMA_STAT_RS_MASK, 17)

/* Transmit process state */
#define DMA_STAT_TS(value)              BIT_FIELD((value), 20)
#define DMA_STAT_TS_MASK                BIT_FIELD(MASK(3), 20)
#define DMA_STAT_TS_VALUE(reg)          FIELD_VALUE((reg), DMA_STAT_TS_MASK, 20)

/* Error bit 1 */
#define DMA_STAT_EB1                    BIT(23)
/* Error bit 2 */
#define DMA_STAT_EB2                    BIT(24)
/* Error bit 3 */
#define DMA_STAT_EB3                    BIT(25)
/*------------------DMA Operation Mode register-------------------------------*/
/* Start/stop receive */
#define DMA_OP_MODE_SR                  BIT(1)
/* Operate on second frame */
#define DMA_OP_MODE_OSF                 BIT(2)

/* Receive threshold control */
#define DMA_OP_MODE_RTC(value)          BIT_FIELD((value), 3)
#define DMA_OP_MODE_RTC_MASK            BIT_FIELD(MASK(2), 3)
#define DMA_OP_MODE_RTC_VALUE(reg) \
    FIELD_VALUE((reg), DMA_OP_MODE_RTC_MASK, 3)

/* Forward undersized good frames */
#define DMA_OP_MODE_FUF                 BIT(6)
/* Forward error frames */
#define DMA_OP_MODE_FEF                 BIT(7)
/* Start/stop transmission command */
#define DMA_OP_MODE_ST                  BIT(13)

/* Transmit threshold control */
#define DMA_OP_MODE_TTC(value)          BIT_FIELD((value), 14)
#define DMA_OP_MODE_TTC_MASK            BIT_FIELD(MASK(3), 14)
#define DMA_OP_MODE_TTC_VALUE(reg) \
    FIELD_VALUE((reg), DMA_OP_MODE_TTC_MASK, 14)

/* Flush transmit FIFO */
#define DMA_OP_MODE_FTF                 BIT(20)
/* Disable flushing of received frames */
#define DMA_OP_MODE_DFF                 BIT(24)
/*------------------DMA Interrupt Enable register-----------------------------*/
/* Transmit interrupt enable */
#define DMA_INT_EN_TIE                  BIT(0)
/* Transmit stopped enable */
#define DMA_INT_EN_TSE                  BIT(1)
/* Transmit buffer unavailable enable */
#define DMA_INT_EN_TUE                  BIT(2)
/* Transmit jabber timeout enable */
#define DMA_INT_EN_TJE                  BIT(3)
/* Overflow interrupt enable */
#define DMA_INT_EN_OVE                  BIT(4)
/* Underflow interrupt enable */
#define DMA_INT_EN_UNE                  BIT(5)
/* Receive interrupt enable */
#define DMA_INT_EN_RIE                  BIT(6)
/* Receive buffer unavailable enable */
#define DMA_INT_EN_RUE                  BIT(7)
/* Receive stopped enable */
#define DMA_INT_EN_RSE                  BIT(8)
/* Receive watchdog timeout enable */
#define DMA_INT_EN_RWE                  BIT(9)
/* Early transmit interrupt enable */
#define DMA_INT_EN_ETE                  BIT(10)
/* Fatal bus error enable */
#define DMA_INT_EN_FBE                  BIT(13)
/* Early receive interrupt enable */
#define DMA_INT_EN_ERE                  BIT(14)
/* Abnormal interrupt summary enable */
#define DMA_INT_EN_AIE                  BIT(15)
/* Normal interrupt summary enable */
#define DMA_INT_EN_NIE                  BIT(16)
/*------------------DMA Missed Frame and Buffer Overflow Counter register-----*/
/* Number of frames missed */
#define DMA_MFRM_BUFOF_FMC(value)       BIT_FIELD((value), 0)
#define DMA_MFRM_BUFOF_FMC_MASK         BIT_FIELD(MASK(16), 0)
#define DMA_MFRM_BUFOF_FMC_VALUE(reg) \
    FIELD_VALUE((reg), DMA_MFRM_BUFOF_FMC_MASK, 0)

