stxent/halm/include/halm/platform/lpc/lpc43xx/ethernet_defs.h
/* Overflow bit for missed frame counter */
#define DMA_MFRM_BUFOF_OC               BIT(16)

/* Number of frames missed by the application */
#define DMA_MFRM_BUFOF_FMA(value)       BIT_FIELD((value), 17)
#define DMA_MFRM_BUFOF_FMA_MASK         BIT_FIELD(MASK(11), 17)
#define DMA_MFRM_BUFOF_FMA_VALUE(reg) \
    FIELD_VALUE((reg), DMA_MFRM_BUFOF_FMA_MASK, 17)

/* Overflow bit for FIFO overflow counter */
#define DMA_MFRM_BUFOF_OF               BIT(28)
/*----------------------------------------------------------------------------*/
struct TransmitDescriptor
{
  volatile uint32_t TDES0;
  volatile uint32_t TDES1;
  volatile uint32_t TDES2;
  volatile uint32_t TDES3;
  volatile uint32_t TDES4;
  volatile uint32_t TDES5;
  volatile uint32_t TDES6;
  volatile uint32_t TDES7;
};

struct TransmitDescriptorAlt
{
  volatile uint32_t TDES0;
  volatile uint32_t TDES1;
  volatile uint32_t TDES2;
  volatile uint32_t TDES3;
};

/* Deferred Bit */
#define TDES0_DB                        BIT(0)
/* Underflow Error */
#define TDES0_UF                        BIT(1)
/* Excessive Deferral */
#define TDES0_ED                        BIT(2)

/* Collision Count or Slot Number control bits */
#define TDES0_CC_SLOTNUM(value)         BIT_FIELD((value), 3)
#define TDES0_CC_SLOTNUM_MASK           BIT_FIELD(MASK(4), 3)
#define TDES0_CC_SLOTNUM_VALUE(reg) \
    FIELD_VALUE((reg), TDES0_CC_SLOTNUM_MASK, 3)

/* VLAN Frame */
#define TDES0_VF                        BIT(7)
/* Excessive Collision */
#define TDES0_EC                        BIT(8)
/* Late Collision */
#define TDES0_LC                        BIT(9)
/* No Carrier */
#define TDES0_NC                        BIT(10)
/* Loss of Carrier */
#define TDES0_LOC                       BIT(11)
/* IP Payload Error */
#define TDES0_IPE                       BIT(12)
/* Frame Flushed */
#define TDES0_FF                        BIT(13)
/* Jabber Timeout */
#define TDES0_JT                        BIT(14)
/* Error Summary */
#define TDES0_ES                        BIT(15)
/* IP Header Error */
#define TDES0_IHE                       BIT(16)
/* Transmit Timestamp Status */
#define TDES0_TTSS                      BIT(17)
/* Second Address Chained */
#define TDES0_TCH                       BIT(20)
/* Transmit End of Ring */
#define TDES0_TER                       BIT(21)
/* Transmit Timestamp Enable */
#define TDES0_TTSE                      BIT(25)
/* Disable Pad */
#define TDES0_DP                        BIT(26)
/* Disable CRC */
#define TDES0_DC                        BIT(27)
/* First Segment */
#define TDES0_FS                        BIT(28)
/* Last Segment */
#define TDES0_LS                        BIT(29)
/* Interrupt on Completion */
#define TDES0_IC                        BIT(30)
/* Own Bit */
#define TDES0_OWN                       BIT(31)

/* Transmit buffer 1 size */
#define TDES1_TBS1(value)               BIT_FIELD((value), 0)
#define TDES1_TBS1_MASK                 BIT_FIELD(MASK(13), 0)
#define TDES1_TBS1_VALUE(reg)           FIELD_VALUE((reg), TDES1_TBS1_MASK, 0)

/* Transmit buffer 2 size */
#define TDES1_TBS2(value)               BIT_FIELD((value), 16)
#define TDES1_TBS2_MASK                 BIT_FIELD(MASK(13), 16)
#define TDES1_TBS2_VALUE(reg)           FIELD_VALUE((reg), TDES1_TBS2_MASK, 16)
/*----------------------------------------------------------------------------*/
struct ReceiveDescriptor
{
  volatile uint32_t RDES0;
  volatile uint32_t RDES1;
  volatile uint32_t RDES2;
  volatile uint32_t RDES3;
  volatile uint32_t RDES4;
  volatile uint32_t RDES5;
  volatile uint32_t RDES6;
  volatile uint32_t RDES7;
};

struct ReceiveDescriptorAlt
{
  volatile uint32_t RDES0;
  volatile uint32_t RDES1;
  volatile uint32_t RDES2;
  volatile uint32_t RDES3;
};

/* Extended Status Available/Rx MAC Address */
#define RDES0_ESA                       BIT(0)
/* CRC Error */
#define RDES0_CE                        BIT(1)
/* Dribble Bit Error */
#define RDES0_DBE                       BIT(2)
/* Receive Error */
#define RDES0_RE                        BIT(3)
/* Receive Watchdog Timeout */
#define RDES0_RWT                       BIT(4)
/* Frame Type */
#define RDES0_FT                        BIT(5)
/* Late Collision */
#define RDES0_LC                        BIT(6)
/* Timestamp Available */
#define RDES0_TSA                       BIT(7)
/* Last Descriptor */
#define RDES0_LS                        BIT(8)
/* First Descriptor */
#define RDES0_FS                        BIT(9)
/* VLAN Tag */
#define RDES0_VLAN                      BIT(10)
/* Overflow Error */
#define RDES0_OE                        BIT(11)
/* Length Error */
#define RDES0_LE                        BIT(12)
/* Source Address Filter Fail */
#define RDES0_SAF                       BIT(13)
/* Descriptor Error */
#define RDES0_DE                        BIT(14)
/* Error Summary */
#define RDES0_ES                        BIT(15)

/* Frame Length */
#define RDES0_FL(value)                 BIT_FIELD((value), 16)
#define RDES0_FL_MASK                   BIT_FIELD(MASK(14), 16)
#define RDES0_FL_VALUE(reg)             FIELD_VALUE((reg), RDES0_FL_MASK, 16)

/* Destination Address Filter Fail */
#define RDES0_AFM                       BIT(30)
/* Own Bit */
#define RDES0_OWN                       BIT(31)

/* Receive buffer 1 size */
#define RDES1_RBS1(value)               BIT_FIELD((value), 0)
#define RDES1_RBS1_MASK                 BIT_FIELD(MASK(13), 0)
#define RDES1_RBS1_VALUE(reg)           FIELD_VALUE((reg), RDES1_RBS1_MASK, 0)

/* Second Address Chained */
#define RDES1_RCH                       BIT(14)
/* Receive End of Ring */
#define RDES1_RER                       BIT(15)

/* Receive buffer 2 size */
#define RDES1_RBS2(value)               BIT_FIELD((value), 16)
#define RDES1_RBS2_MASK                 BIT_FIELD(MASK(13), 16)
#define RDES1_RBS2_VALUE(reg)           FIELD_VALUE((reg), RDES1_RBS2_MASK, 16)
/*----------------------------------------------------------------------------*/
#endif /* HALM_PLATFORM_LPC_LPC43XX_ETHERNET_DEFS_H_ */
